[
    {
        "title": "Am I the asshole for telling my sister she can't live with us anymore after she called CPS on me as a \"joke\"?",
        "content": "I (30F) need to know if I'm being too harsh here because my family is completely divided.My younger sister (26F) moved in with my husband (32M) and me about four months ago after she lost her job. We have a toddler and a baby, so it's been hectic, but we wanted to help her get back on her feet. She was supposed to stay for two months max while job hunting.Here's where it gets messy. Last week, I asked her to watch the kids for an hour while I ran to the pharmacy. When I got back, she was on her phone while my toddler had gotten into the pantry and made a huge mess with flour everywhere. I'll admit, I lost my temper and told her she needs to actually WATCH them when she agrees to babysit.She got defensive and said I was being ungrateful for \"free childcare\" (reminder: she lives here rent-free). We argued, and I told her if she can't do the bare minimum to help out, she needs to start looking for her own place.Two days later, CPS showed up at my door. The worker said they received a report that I was \"overwhelmed and potentially neglecting my children.\" I was MORTIFIED. After they left (finding nothing wrong, obviously), my sister started laughing and said she called them to \"teach me a lesson about being ungrateful\" and that it was \"just a prank.\"I told her to pack her stuff and get out. Now.She's been staying with our parents, who are FURIOUS with me. They say she made a stupid mistake but she's family and I'm overreacting. They keep saying she was just stressed about being unemployed and lashed out. My mom even said I'm \"ruining her life\" over a joke gone wrong.My husband backs me 100% and says what she did was unforgivable. But now half my extended family isn't speaking to me, and my mom calls daily crying about how I'm tearing the family apart. My aunt even posted on Facebook about how \"some people forget where they came from\" (clearly about me).The thing is, I keep second-guessing myself. She IS my sister, and she's never done anything like this before. But I can't get over the fact that she weaponized CPS against me. That's not a joke. That could have had serious consequences for my family.Am I the asshole for kicking her out and refusing to let her come back?EDIT: Since people are asking. Yes, the CPS worker confirmed someone called in a report. No, I don't have proof it was my sister beyond her admission. And yes, I realize now I should have recorded her confession but I was too shocked in the moment.",
        "url": "https://www.reddit.com/r/AITAH/comments/1ktqzkv/aitah_for_telling_my_sister_she_cant_live_with_us/",
        "posted": true,
        "postcount": 0
    },
    {
        "title": "Am I the asshole for refusing to continue breastfeeding the twins I was a surrogate for?",
        "content": "I am 32F and served as a surrogate mother to my 36F sister who couldn't bear children as a result of her cancer treatments. I carried twins for her and her husband using their embryos. The delivery took place 3 months ago.This is where it got bizarre. My sister keeps requesting me to breastfeed the twins since \"breast is best\" and she can't lactate. I agreed at first since I wanted to assist her, but it is taking over. She insists I visit her 5-6 TIMES A DAY or express milk enough for all meals. I work full-time and have my own 4-year-old child to look after.I informed her I would need to reduce to perhaps twice a day and some expressed milk and she burst out crying telling me I was depriving the babies of the opportunity at optimal health. Her husband sent me a text stating I was selfish as I \"already did the hard part\" and should still assist them.The situation boiled over yesterday when I walked in and discovered my sister had created a bedroom for me and insisted I just come in to feed the twins whenever they wanted. I told her no and mentioned that formula was a perfectly adequate way to supplement. She took offense and said I was abandoning my nephews and breaking our agreement.I left without giving them food. My mom said my sister and I should be more understanding about her situation but to be honest I feel my body is being used as a dairy farm. Am I the asshole  if I wouldn't want to be their full-time milk supply?",
        "url": "https://www.reddit.com/r/AITAH/comments/1ktobo5/aita_for_refusing_to_continue_breastfeeding_the/",
        "posted": true,
        "postcount": 1
    },
    {
        "title": "Am I the asshole for kicking out my girlfriend's friend after she insulted her for breastfeeding?",
        "content": "I (30M) live with my girlfriend, Lily (not a real name), and our 3 month old daughter. Lily is incredibly kind and always puts others first. One of her old friends, Jenna, came over last weekend after not seeing Lily for a while. I've never liked Jenna, she always makes everything about herself.While I was in the kitchen, Lily started breastfeeding our baby in the living room. Jenna suddenly said, That's gross, no one wants to see that, implying it was inappropriate. Lily came into the kitchen upset and continued feeding there, visibly shaken.I was pissed. No one makes the mother of my child feel ashamed for feeding our baby, especially not in our own home. I walked in, saw Jenna rummaging through our things, and told her to get out. She acted confused, so I told her I wasn't asking twice. She left.Later that night, Jenna called Lily and claimed I threatened her and said we were lucky she wasn't calling the cops. I took the phone, told her to never contact us again, and blocked her.I don't regret it. A baby needs to eat, and there's nothing wrong with a mom breastfeeding. So, Am I the asshole H?",
        "url": "https://www.reddit.com/r/AITAH/comments/1ktphgh/aitah_for_kicking_out_my_girlfriends_friend_after/",
        "posted": true,
        "postcount": 1
    },
    {
        "title": "M37 caught girlfriend F31 secretly recording me.",
        "content": "My girlfriend was leaving to a concert with her sister. Before she left she set up at least 3 devices to record just audio. I found the 3 set up one was in our bedroom one in our bathroom and the other in the back room of our house. When she came home she acted like nothing happened and she just stalled until I had to try and get sleep. The next morning I woke up went through the morning routine and once she was up and going I asked for her phone she started to hand it over until I asked for her passcode. (She has always had access to mine at anytime and any point) She pulled back and asked why. That when I told her I had busted her and she instantly denied it. I told her I took pics to prove it and showed her. She keep denying, until I walked away. Then admitted it to me, and she knew she was busted because she heard on the recordings me freaking out once I found the first. Now I don't feel comfortable in my own house. She invaded my privacy in the one place I feel it should be the safest. I told her we are not together anymore and moved her out of the bedroom. ",
        "url": "https://www.reddit.com/r/AITAH/comments/1ktelh1/m37_caught_girlfriend_f31_secretly_recording_me/",
        "posted": true,
        "postcount": 1
    }
]